# TDS Week 3 Assignment

# Imports

In [5]:
# ---------- Common ------------
import os
import time
import json
import random
import ast
from datetime import datetime

# ---------- Data Manipulation ------------
import pandas as pd
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', None)
import numpy as np

# import pandas_profiling
# from pandas_profiling import ProfileReport

## Common helper functions

In [2]:
def display_scores(scores):
    print(f'Scores: {scores}')
    print(f'Mean: {scores.mean()}')
    print(f'Std Dev: {scores.std()}')
    return

## Clean Excel

In [1]:
# trim white spaces: =TRIM(<cell value>)
# remove duplicate: copy column to new sheet -> select column -> Data tab -> remove dupicates
# delete rows with blank cells: select column -> Home tab -> find and select -> go to special -> blank -> right click -> delete

In [2]:
# Text to column : split single column to multiple
# slect column -> go to data tab -> select text to column 
# -> select delimiter -> ok
# repeat till desired results obtained

In [3]:
# use pivot tables, sparklines, color scales, databars

## Pandas Profiling

In [2]:
url='https://drive.google.com/file/d/1KjrSid8AfVggkCX3pmcpRE-OAi8CHVUr/view?usp=sharing'
url2='https://drive.google.com/uc?id=' + url.split('/')[-2]
df = pd.read_csv(url2,encoding='latin-1')
# OR df = pd.read_csv("ExcelScraping_Final_for_pandas_profiling.csv",encoding='latin-1')
df.head(3)

,City[a],Country,UN 2018 population estimates[b],City proper[c] Definition,City proper[c] Population,City proper[c] Area (km2),City proper[c] Density (/km2),Metropolitan area[d] Population,Metropolitan area[d] Area (km2),Metropolitan area[d] Density (/km2),Urban area[12] Population,Urban area[12] Area (km2),Urban area[12] Density (/km2)
0,Tokyo,Japan,37400068,Metropolis prefecture,13515271.0,2191.0,6169.0,37274000.0,13452.0,2771.0,39105000.0,8231.0,4751.0
1,Delhi,India,28514000,Capital City,16753235.0,1484.0,11289.0,29000000.0,3483.0,8326.0,31870000.0,2233.0,14272.0
2,Seoul,South Korea,25674800,Special city,10013781.0,605.0,16208.0,25514000.0,11704.0,2180.0,22394000.0,2769.0,8087.0

In [6]:
# prof = ProfileReport(df) # run it in colab only
# prof.to_file('profiling_report.html')
# files.download('report.html')

# Assignment

### Load Data: On data.gov.in, "Variety-wise Daily Market Prices Data of Goat 2022".

In [3]:
root_path = r"C:\Users\tusha\Jupyter_notebooks\IITM_Term_5\TDS"
os.listdir(root_path)

['.ipynb_checkpoints',
 'Goat_2022.csv',
 'rainfall-dataset.csv',
 'TDS Week 2 Assignment.ipynb',
 'TDS Week 3 Assignment.ipynb',
 'TDS_Week_1_Assignment.ipynb']

In [6]:
data_path = os.path.join(root_path, 'rainfall-dataset.csv')
df = pd.read_csv(data_path)
print(f"Data Shape: {df.shape}")

Data Shape: (4187, 14)

In [7]:
df.head()

,State,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC
0,Andaman & Nicobar Islands,1901,49.2,87.1,29.2,2.3,528.8,517.5,365.1,481.1,332.6,388.5,558.2,33.6
1,Andaman & Nicobar Islands,1902,0.0,159.8,12.2,0.0,446.1,537.1,228.9,753.7,666.2,197.2,359.0,160.5
2,Andaman & Nicobar Islands,1903,12.7,144.0,0.0,1.0,235.1,479.9,728.4,326.7,339.0,181.2,284.4,225.0
3,Andaman & Nicobar Islands,1904,9.4,14.7,0.0,202.4,304.5,495.1,502.0,160.1,820.4,222.2,308.7,40.1
4,Andaman & Nicobar Islands,1905,1.3,0.0,3.3,26.9,279.5,628.7,368.7,330.5,297.0,260.7,25.4,344.7

In [8]:
df.isnull().sum(axis=0)

State    0
YEAR     0
JAN      0
FEB      0
MAR      0
APR      0
MAY      0
JUN      0
JUL      0
AUG      0
SEP      0
OCT      0
NOV      0
DEC      0
dtype: int64

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4187 entries, 0 to 4186
Data columns (total 14 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   State   4187 non-null   object
 1   YEAR    4187 non-null   int64
 2   JAN     4187 non-null   float64
 3   FEB     4187 non-null   float64
 4   MAR     4187 non-null   float64
 5   APR     4187 non-null   float64
 6   MAY     4187 non-null   float64
 7   JUN     4187 non-null   float64
 8   JUL     4187 non-null   float64
 9   AUG     4187 non-null   float64
 10  SEP     4187 non-null   float64
 11  OCT     4187 non-null   float64
 12  NOV     4187 non-null   float64
 13  DEC     4187 non-null   float64
dtypes: float64(12), int64(1), object(1)
memory usage: 458.1+ KB

In [14]:
df["Annual"] = df['JAN']+df['FEB']+df['MAR']+df['APR']+df['MAY']+df['JUN']+df['JUL']+df['AUG']+df['SEP']+df['OCT']+df['NOV']+df['DEC']

In [18]:
df["Average"] = df["Annual"]/12

### Q.7] What is total rainfall across all years (1901-2017) for the state "Matathwada"assigned? 
Note: Ignore the years for which data is not available

In [17]:
df.loc[(df['State']=='Matathwada'), "Annual"].sum()

92632.6

### Q.8] What is average annual rainfall across years (1901-2017) for the state "Coastal Andhra Pradesh"?
Note: Ignore the years for which data is not available

In [21]:
df.loc[(df['State']=='Coastal Andhra Pradesh'), "Annual"].sum()/117

1050.3042735042734

### Q.9] What is the average monthly rainfall for the state "Bihar" for the year "1985"?
Note: Ignore the years for which data is not available

In [22]:
df.loc[(df['State']=='Bihar')&(df['YEAR']==1985)]

,State,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Annual,Average
997,Bihar,1985,8.8,0.5,0.5,8.0,69.2,163.2,481.5,238.0,289.0,188.0,1.2,7.1,1455.0,121.25

### Q.10] What is the annual rainfall for the state "Rayalseema" for the year "1979"?
Note: Ignore the years for which data is not available

In [24]:
df.loc[(df['State']=='Rayalseema')&(df['YEAR']==1979)]

,State,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,Annual,Average
3448,Rayalseema,1979,3.2,19.4,0.0,7.0,96.6,49.7,72.2,79.7,155.3,61.5,256.6,12.3,813.5,67.791667

# END